content/blog/be-wary-of-self-described-benefits.md
+++
title = "Be Wary of Self Described Benefits"
author = ["Rakhim Davletkaliyev"]
date = 2019-09-03T18:06:00+03:00
draft = false
creator = "Emacs 26.2 (Org mode 9.1.9 + ox-hugo)"
+++

Picking a university was one of the main tasks in the last year of high school. That and exams. I wasn't sure what to study and which place to pick. I had no idea _how_ one can make these choices. There weren't too many resources available at the time. So, a lot of us relied on promotional info provided by universities themselves.

The one I ended up in was called SDU. Its official description says: "SDU is a secular higher educational institution located in Kaskelen, near Almaty."

It was the only university that actually claimed to be secular. That's good, right? I had no interest in studying at a religious institution. Secular is good.

Turned out, it wasn't very secular. No, we didn't study Holy Texts. Officially, nothing religious was going on. But the Islamic values did indeed feel affecting the policies and decisions everywhere. The dormitories for males and females were separate buildings in different neighborhoods. I had actually never seen the women's dormitory, nor had any male student around. The girls just went to a mysterious place every evening. A large proportion of students held a religious fast (Ramadan). Several instructors gave bonuses to fasting students. So I had to work harder to get the same grade because I was being secular at a secular university.

I dropped out after 4 months. Thank _God_.

Later, I started to notice this pattern. Often, people, communities, companies and even countries seem to blindly put positive descriptions out. As if they _wanted_ others to notice.

It becomes very clear in case of countries. Here are some famous authoritarian regimes:

-   Democratic People's Republic of Korea
-   Democratic Republic of the Congo
-   People's Republic of China
-   People’s Democratic Republic of Algeria
-   Federal Democratic Republic of Ethiopia

Right.

So I learned to be wary of self described benefits. It's kind of obvious and silly once you think about it.

Yours truly,
not passive aggressive at all, Rakhim.
